#language: ru

@tree

Функционал: заказ покупателя

Как менеджер по продажам я хочу
зафиксировать заказанный покупателем  товар 
чтобы проанализировать разницу между тем что было заказано и что фактически отгрузили   

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: _0407 подготовительный сценарий (заказ покупателю)
	Когда экспорт основных данных

Сценарий: заказ покупателю
	*Заполнение документа заказ покупателя
		И я закрываю все окна клиентского приложения
		Дано Я открываю навигационную ссылку "e1cib/list/Document.SalesOrder"
		И я нажимаю на кнопку с именем 'FormCreate'
		И я нажимаю кнопку выбора у поля с именем 'Partner'
		Тогда открылось окно "Партнеры"
		И в таблице 'List' я перехожу к строке:
			| "Код" | "Наименование"            |
			| "1"   | "Клиент 1 (1 соглашение)" |
		И в таблице 'List' я выбираю текущую строку
		И я запоминаю значение поля "Партнер" как "ПартнерЗначение"
		И я нажимаю кнопку выбора у поля с именем 'Agreement'
		И в таблице 'List' я перехожу к строке:
			| 'Код' | 'Наименование'                                                    |
			| '1'   | 'Соглашение с клиентами (расчет по документам + кредитный лимит)' |
		И в таблице 'List' я выбираю текущую строку
		Когда открылось окно "Табличная часть товаров будет обновлена"
		И я нажимаю на кнопку с именем 'FormOK'
		И я запоминаю значение поля "Соглашение" как "СоглашениеЗначение"
	
	*Проверка заполнения полей Партнер и Конетрагент
		Тогда элемент формы с именем 'Partner' стал равен "$ПартнерЗначение$"
		Тогда элемент формы с именем 'Agreement' стал равен "$СоглашениеЗначение$"
				
	*Проверка блокировки поля Контрагент	
//	Проверяю что клиент заполняется если заполнен Партнер
		И я нажимаю кнопку выбора у поля с именем 'LegalName'
		И в таблице 'List' я перехожу к строке:
			| 'Код' | 'Наименование' |
			| '5'   | 'Клиент 1'     |
		И в таблице 'List' я выбираю текущую строку
		Тогда элемент формы с именем 'LegalName' стал равен "Клиент 1"
//Проверяю что клиент не заполняется если Партер пуст
		Когда открылось окно "Заказ покупателя (создание) *"
		И я нажимаю кнопку очистить у поля с именем 'Partner'
		Когда Проверяю шаги на Исключение:
			|'И в поле с именем "LegalName" я ввожу текст "Клиент 1"'|
				
		

				
				
				
							
				

