#language: ru

@tree
@Движение документов
Функционал: проверка движения документа Возврат от покупателя

Как тестировщик я хочу
проверить движения документа Возврат от покупателя 
чтобы убедиться что документ делает движения по нужным регистрам   

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: _0407 подготовительный сценарий (движения документа Возврат от покупателя)
	Когда экспорт основных данных
	Когда Загрузка документа Возврат от покупателя
	И я выполняю код встроенного языка на сервере
		|'Документы.SalesReturn.НайтиПоНомеру(1050).ПолучитьОбъект().Записать(РежимЗаписиДокумента.Проведение);'|

Сценарий: _0402 проверка движений документа возврат от покупателя в  отчете D2001 Продажи
		И я закрываю все окна клиентского приложения
		Дано Я открываю навигационную ссылку "e1cib/list/Document.SalesReturn"
		И в таблице "List" я перехожу к строке
		|'Номер'|
		|'1 050'|
		И я нажимаю на кнопку с именем 'FormReportDocumentRegistrationsReportRegistrationsReport'
		Тогда открылось окно "Движения документа"
		И из выпадающего списка с именем 'FilterRegister' я выбираю точное значение "R2001 Продажи"
		И я нажимаю на кнопку с именем 'GenerateReport'
		Тогда табличный документ 'ResultTable' равен:
			| 'Возврат товаров от покупателя 1 050 от 01.08.2025 15:00:00' | ''                    | ''           | ''        | ''                  | ''             | ''                       | ''                          | ''                             | ''       | ''                                                    | ''               | ''                                     |
			| 'Движения документа по регистрам'                            | ''                    | ''           | ''        | ''                  | ''             | ''                       | ''                          | ''                             | ''       | ''                                                    | ''               | ''                                     |
			| 'Регистр  "R2001 Продажи"'                                   | ''                    | ''           | ''        | ''                  | ''             | ''                       | ''                          | ''                             | ''       | ''                                                    | ''               | ''                                     |
			| ''                                                           | 'Period'              | 'Resources'  | ''        | ''                  | ''             | 'Dimensions'             | ''                          | ''                             | ''       | ''                                                    | ''               | ''                                     |
			| ''                                                           | ''                    | 'Количество' | 'Сумма'   | 'Сумма без налогов' | 'Сумма скидки' | 'Организация'            | 'Структурное подразделение' | 'Вид мультивалютной аналитики' | 'Валюта' | 'Инвойс'                                              | 'Характеристика' | 'Ключ строки'                          |
			| ''                                                           | '01.08.2025 15:00:00' | '-1'         | '-190'    | '-158,33'           | ''             | 'Собственная компания 1' | 'Подразделение 1'           | 'В валюте отчетности'          | 'USD'    | 'Реализация товаров и услуг 1 от 24.02.2021 10:14:47' | 'S/Красный'      | 'dcdcbe9e-5743-49b6-8ca8-8e95b7ac6b89' |
			| ''                                                           | '01.08.2025 15:00:00' | '-1'         | '-190'    | '-158,33'           | ''             | 'Собственная компания 1' | 'Подразделение 1'           | 'Валюта соглашения, USD'       | 'USD'    | 'Реализация товаров и услуг 1 от 24.02.2021 10:14:47' | 'S/Красный'      | 'dcdcbe9e-5743-49b6-8ca8-8e95b7ac6b89' |
			| ''                                                           | '01.08.2025 15:00:00' | '-1'         | '-190'    | '-158,33'           | ''             | 'Собственная компания 1' | 'Подразделение 1'           | 'en наименование не заполнено' | 'USD'    | 'Реализация товаров и услуг 1 от 24.02.2021 10:14:47' | 'S/Красный'      | 'dcdcbe9e-5743-49b6-8ca8-8e95b7ac6b89' |
			| ''                                                           | '01.08.2025 15:00:00' | '-1'         | '-163,21' | '-136,01'           | ''             | 'Собственная компания 1' | 'Подразделение 1'           | 'В локальной валюте страны'    | 'EUR'    | 'Реализация товаров и услуг 1 от 24.02.2021 10:14:47' | 'S/Красный'      | 'dcdcbe9e-5743-49b6-8ca8-8e95b7ac6b89' |
			| ''                                                           | '01.08.2025 15:00:00' | '-1'         | ''        | ''                  | ''             | 'Собственная компания 1' | 'Подразделение 1'           | 'В валюте бюджетирования'      | 'EUR'    | 'Реализация товаров и услуг 1 от 24.02.2021 10:14:47' | 'S/Красный'      | 'dcdcbe9e-5743-49b6-8ca8-8e95b7ac6b89' |
		
								