#language: ru

@tree

Функционал: <описание фичи>

Как тестировщик я хочу
заполнить поле Организация с помощью условия 
чтобы уметь это делать  

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: заполнить поле Организация с помощью условия
	И В командном интерфейсе я выбираю "Продажи" "Заказы покупателей"
	И я нажимаю на кнопку с именем 'FormCreate'
	И я нажимаю кнопку выбора у поля с именем 'Agreement'
	И я нажимаю на кнопку с именем 'FormChoose'
	И я нажимаю на кнопку открытия поля с именем 'Agreement'
	И я запоминаю значение поля с именем 'Company' как 'Организация'
	И Я закрываю окно "Соглашение с клиентами (расчет по документам + кредитный лимит) (Соглашение)"
	Если поле с именем 'Company' не заполнено Тогда
		И я нажимаю кнопку выбора у поля с именем 'Company'
		Тогда открылось окно "Организации"
		И в таблице 'List' я активизирую дополнение формы с именем 'ListSearchString'
		И в таблице 'List' в дополнение формы с именем 'ListSearchString' я ввожу текст "$Организация$"
		И я нажимаю на кнопку с именем 'FormChoose'
	Иначе
	Тогда элемент формы с именем 'Company' стал равен "Собственная компания 1"
	И я закрываю все окна клиентского приложения
			
			
	
