#language: ru

@tree

Функционал: <описание фичи>

Как тетсировщик я хочу
создать 10 элементов справочника Номенклатура 
чтобы сгенерировать тестовые даанные   

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: создание большого объема данных (справочник Номенклатура)
	И В командном интерфейсе я выбираю "Продажи" "Номенклатура"
	Тогда открылось окно "Номенклатура"
	И в таблице 'List' я активизирую поле с именем 'ItemType'
	И Я запоминаю значение выражения '0' в переменную "Шаг"
	И я делаю 10 раз
		И Я запоминаю значение выражения '$Шаг$+1' в переменную "Шаг"
		И Я запоминаю значение выражения '"номенклатура"+$Шаг$' в переменную "Номенклатура"
		И я проверяю или создаю для справочника "Items" объекты:
		| 'Ref'                                                               | 'DeletionMark' | 'Code' | 'ItemType' | 'Unit' | 'MainPricture' | 'Vendor' | 'ItemID' | 'PackageUnit' | 'Description_en' | 'Description_hash' | 'Description_ru' | 'Description_tr' | 'Height' | 'Length' | 'Volume' | 'Weight' | 'Width' |
		| '{"e1cib/data/Catalog.Items?ref=" + StrReplace(New UUID, "-", "")}' | 'False'        |        | ''         |        |                |          |          | ''            | '$Номенклатура$' | ''                 | ''               | ''               |          |          |          |          |         |
