#language: ru

@tree

Функционал: 7.1 Финальные практические задания курса.

//Задания:
//	1. В форму элемента справочника Товар была добавлена возможность прикрепления файла картинки.
//	2. В конфигурацию добавили отчет для вывода остатков товаров (отчет Остатки). 
//		Достаточно протестировать основной вариант. При тестировании на чистой базе, после загрузки настроек отчета, может понадобиться пауза, 
//		чтобы настройки успели прогрузится (шаг И Пауза 20).
//	3. Добавлен документ РасходТовара (Продажи – Документ Продажи).  
//		Необходимо написать тесты для его полной проверки, включая проведение, движения по регистрам, 
//		а также печатные формы Расходная товарная накладная (в печатной форме проверка по заполнению значения в поле Дата не нужна).

Как тестировщик я хочу
	1. Проверить корректность прикрепления файла картинки в форме элемента справочника товары.
	2. Проверить отчет для вывода остатков "Остатки" 
	3. Проверить полностью работу документа "РасходТовара"
чтобы корректно работали перечисленные элементы при релизе	 

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: 1.Прикрепление картинки в элемент справочника товар
	*Подготовка и открытие элемента справочника
		Дано Я открываю навигационную ссылку "e1cib/data/Справочник.Товары?ref=a9b200055d49b45e11db97442336eb57"
	*Очистка картинки, если она уже прикреплена
		И я нажимаю кнопку очистить у поля с именем 'ФайлКартинки'
		И я нажимаю на кнопку с именем 'ОбновитьКартинку'
		И я нажимаю на кнопку с именем 'ФормаЗаписать'
	*Прикрепление картинки
		И я нажимаю кнопку выбора у поля с именем 'ФайлКартинки'
		Тогда открылось окно "Файлы"
		И в таблице 'Список' я перехожу к строке:
			| "Код"       | "Наименование" |
			| "000000007" | "Вихрь"        |
		И я нажимаю на кнопку с именем 'ФормаВыбрать'
		И я нажимаю на кнопку с именем 'ОбновитьКартинку'
		И я нажимаю на кнопку с именем 'ФормаЗаписать'
				
	*Проверка прикрепленного файла
		И элемент формы с именем 'ФайлКартинки' стал равен "Вихрь"
		И у элемента формы с именем 'Картинка' текст редактирования стал равен "e1cib/data/Справочник.ХранимыеФайлы.ДанныеФайла?ref=a9d700179a069b1011dc44ecea1d4f5c"
	*Закрытие ненужных окон
		И я закрываю все окна клиентского приложения


Сценарий: 2.Проверка отчета "Остатки"
	*Загрузка данных для теста
		И Загрузка данных
	*Открытие отчета и выбор варианта
		И В командном интерфейсе я выбираю "Закупки" "Остатки товаров"
		И я нажимаю на кнопку с именем 'ФормаЗагрузитьВариант'
		И в таблице 'СписокНастроек' я перехожу к строке:
			| "Представление" |
			| "Основной"      |
		И я нажимаю на кнопку с именем 'Загрузить'
		И пауза 20
	*Формирование отчета
		И я нажимаю на кнопку с именем 'ФормаСформировать'
	*Проверка Данных
		Тогда табличный документ 'Результат' равен макету "МакетОстаткиТоваров" по шаблону
	*Закрытие окон
		И я закрываю все окна клиентского приложения
		
Сценарий: 3.Документ расход товара
	*Создание документа 
		И В командном интерфейсе я выбираю "Продажи" "Продажи"
		И я нажимаю на кнопку с именем 'ФормаСоздать'
	*Заполнение шапки документа
		И я нажимаю кнопку выбора у поля с именем 'Дата'
		И в поле с именем 'Дата' я ввожу текст "05.12.2025  0:00:00"
		И из выпадающего списка с именем 'Организация' я выбираю точное значение "ООО \"1000 мелочей\""
		И я нажимаю кнопку выбора у поля с именем 'Покупатель'
		Тогда открылось окно "Контрагенты"
		И в таблице 'Список' в дополнение формы с именем 'СписокСтрокаПоиска' я ввожу текст "Магазин \"Бытовая техника\""
		И пауза 2
		И я нажимаю на кнопку с именем 'ФормаВыбрать'
		И из выпадающего списка с именем 'Склад' я выбираю точное значение "Склад отдела продаж"
	*Проверка что поле "ВидЦен" заполнилось из карточки Контрагента
		И я нажимаю на кнопку открытия поля с именем 'Покупатель'
		И я запоминаю значение поля с именем "ВидЦен" как "ВидЦены"
		И Я закрываю окно "Магазин \"Бытовая техника\" (Контрагент)"
		Тогда элемент формы с именем 'ВидЦен' стал равен "$ВидЦены$"
	*Добавление товара1
		Когда открылось окно "Продажа товара (создание) *"
		И в таблице 'Товары' я нажимаю на кнопку с именем 'ТоварыДобавить'
		И в таблице 'Товары' я нажимаю кнопку выбора у реквизита с именем 'ТоварыТовар'
		И в таблице 'Список' в дополнение формы с именем 'СписокСтрокаПоиска' я ввожу текст "Торт"
		И пауза 2
		И я нажимаю на кнопку с именем 'ФормаВыбрать'
		И в таблице 'Товары' я активизирую поле с именем 'ТоварыКоличество'
		И в таблице 'Товары' в поле с именем 'ТоварыКоличество' я ввожу текст "2,00"
		И я запоминаю значение поля с именем 'ТоварыКоличество' как "ТоварыКоличество1"
		И я перехожу к следующему реквизиту
		И я запоминаю значение поля с именем 'ТоварыЦена' таблицы 'Товары' как "ТоварыЦена1"
		И в таблице 'Товары' я завершаю редактирование строки

	*Проверка расчета построчной суммы первого товара
		И Я запоминаю значение выражения 'Строка(Число($ТоварыКоличество1$)*Число($ТоварыЦена1$))+",00"' в переменную 'Сумма1'
		И в таблице 'Товары' поле с именем 'ТоварыСумма' имеет значение '$Сумма1$'		
	*Добавление товара2		
		И в таблице 'Товары' я нажимаю на кнопку с именем 'ТоварыДобавить'
		И в таблице 'Товары' я нажимаю кнопку выбора у реквизита с именем 'ТоварыТовар'
		И в таблице 'Список' в дополнение формы с именем 'СписокСтрокаПоиска' я ввожу текст "Молоко"
		И пауза 2
		И я нажимаю на кнопку с именем 'ФормаВыбрать'
		И в таблице 'Товары' я активизирую поле с именем 'ТоварыКоличество'
		И в таблице 'Товары' в поле с именем 'ТоварыКоличество' я ввожу текст "3,00"
		И я запоминаю значение поля с именем 'ТоварыКоличество' как "ТоварыКоличество2"
		И я перехожу к следующему реквизиту
		И я запоминаю значение поля с именем 'ТоварыЦена' таблицы 'Товары' как "ТоварыЦена2"
		И в таблице 'Товары' я завершаю редактирование строки
	*Проверка расчета построчной суммы второго товара
		И Я запоминаю значение выражения 'Строка(Число($ТоварыКоличество2$)*Число($ТоварыЦена2$))+",00"' в переменную 'Сумма2'
		И в таблице 'Товары' поле с именем 'ТоварыСумма' имеет значение '$Сумма2$'
	*Проверка итоговых сумм
		И Я запоминаю значение выражения 'Строка(Число($ТоварыКоличество1$)+Число($ТоварыКоличество2$))' в переменную 'ИтогКоличество'
		И элемент формы 'Количество (итог)' стал равен '$ИтогКоличество$'
		И Я запоминаю значение выражения 'Строка(Число($Сумма1$)+Число($Сумма2$))' в переменную 'ИтогСумма'
		И элемент формы с именем 'ТоварыИтогСумма' стал равен '$ИтогСумма$'

	*Запись и Проведение документа
		И я нажимаю на кнопку с именем 'ФормаЗаписать'
		И я нажимаю на кнопку с именем 'ФормаПровести'

	*Проверка печатной формы расходной накладной
		И я нажимаю на кнопку с именем 'ФормаДокументРасходТовараПечатьРасходнойНакладной'
		Тогда табличный документ 'SpreadsheetDocument' равен:
			| 'Расход товара' | ''                                             | ''           | ''      |
			| ''              | ''                                             | ''           | ''      |
			| 'Номер'         | '*'                                            | ''           | ''      |
			| 'Дата'          | '*'                                            | ''           | ''      |
			| 'Покупатель'    | 'Магазин "Бытовая техника"'                    | ''           | ''      |
			| 'Склад'         | 'Склад отдела продаж'                          | ''           | ''      |
			| 'Сумма'         | '629 рублей (Шестьсот двадцать девять рублей)' | ''           | ''      |
			| 'Вес'           | ''                                             | ''           | ''      |
			| ''              | ''                                             | ''           | ''      |
			| 'Товар'         | 'Цена'                                         | 'Количество' | 'Сумма' |
			| 'Торт '         | '250'                                          | '2'          | '500'   |
			| 'Молоко'        | '43'                                           | '3'          | '129'   |
		
		И я закрываю текущее окно
		
						

	*Проверка движений по регистрам
		И В текущем окне я нажимаю кнопку командного интерфейса "Регистр взаиморасчетов с контрагентами"
		Тогда таблица 'Список' стала равной:
			| 'Период' | 'Регистратор' | 'Номер строки' | 'Контрагент'                | 'Сумма'  | 'Валюта' |
			| '*'      | '*'           | '1'            | 'Магазин "Бытовая техника"' | '629,00' | ''       |

		И В текущем окне я нажимаю кнопку командного интерфейса "Регистр продаж"
		Тогда таблица 'Список' стала равной:
			| 'Период' | 'Регистратор' | 'Номер строки' | 'Покупатель'                | 'Товар'  | 'Количество' | 'Сумма'  |
			| '*'      | '*'           | '1'            | 'Магазин "Бытовая техника"' | 'Торт '  | '2,00'       | '500,00' |
			| '*'      | '*'           | '2'            | 'Магазин "Бытовая техника"' | 'Молоко' | '3,00'       | '129,00' |
			
		И В текущем окне я нажимаю кнопку командного интерфейса "Регистр товарных запасов"
		Тогда таблица 'Список' стала равной:
			| 'Период' | 'Регистратор' | 'Номер строки' | 'Товар'  | 'Склад'               | 'Количество' |
			| '*'      | '*'           | '1'            | 'Торт '  | 'Склад отдела продаж' | '2,00'       |
			| '*'      | '*'           | '2'            | 'Молоко' | 'Склад отдела продаж' | '3,00'       |

	*Удаление созданного документа
		И В текущем окне я нажимаю кнопку командного интерфейса "Основное"
		И я нажимаю на кнопку с именем 'ФормаУдалить'
		Тогда открылось окно "1С:Предприятие"
		И я нажимаю на кнопку с именем 'Button0'
				
				
		
				
				
		
				
		
						
				



				
					
				
					

				
				

		

									
				
				
				
	
	
